In [ ]:
#1. What is lambda
'''
2. lambda and map
3. lambda and reduce 
4. lambda and apply 
5. Pandas {apply, filter, map}
5. Pandas conditional lambda 
'''

In [1]:
def my_func1(num1,num2):
    num = num1 + num2
    return num

In [2]:
def my_func(num1,num2):
    return num1 + num2

In [7]:
my_sum = lambda num1,num2: num1 + num2

In [8]:
my_func(5,3)

8

In [9]:
my_func1(5,3)

8

In [10]:
my_sum(5,3)

8

In [55]:
# example1

In [29]:
# next level 
# map lambda or any other function 
# map(function , iterables)

In [36]:
#lambda x: (float(9)/5)*x + 32

In [13]:
Celsius = [39.2, 36.5, 37.3, 37.8]
Fahrenheit = map(lambda x: (float(9)/5)*x + 32, Celsius) # apply the func on list 
Fahrenheit

In [14]:
print(list(Fahrenheit))

[102.56, 97.7, 99.14, 100.03999999999999]

In [39]:
#example 2

In [15]:
fib = [0,1,1,2,3,5,8,13,21,34,55]
result = filter(lambda x: x % 2 , fib) # finds odd number 
print(list(result))

[1, 1, 3, 5, 13, 21, 55]

In [47]:
# example 3

In [16]:
from functools import reduce

In [17]:
my_list = [3,6,9,12,9]
reduce(lambda x,y: x+y,my_list)

39

In [ ]:
# example 4

In [18]:
(lambda x: x*x*x)(10)

1000

In [53]:
# lambda on pandas

In [20]:
import pandas as pd

In [27]:
df=pd.DataFrame({
    'id':[1,2,3,4,5],
    'name':['Shiva','Hari','Ram','Krishna','Madhav'],
    'age':[20,25,15,10,30],
    'income':[4000,7000,200,0,10000]
})

In [28]:
df

   id     name  age  income
0   1    Shiva   20    4000
1   2     Hari   25    7000
2   3      Ram   15     200
3   4  Krishna   10       0
4   5   Madhav   30   10000

In [22]:
df['age']=df.apply(lambda x: x['age']+4,axis=1) # add 4 to everyone's age
df

   id     name  age  income
0   1    Shiva   24    4000
1   2     Hari   29    7000
2   3      Ram   19     200
3   4  Krishna   14       0
4   5   Madhav   34   10000

In [23]:
df['age'] = df['age'].apply(lambda x:x -4) # now remove 4 years 
df

   id     name  age  income
0   1    Shiva   20    4000
1   2     Hari   25    7000
2   3      Ram   15     200
3   4  Krishna   10       0
4   5   Madhav   30   10000

In [24]:
list(filter(lambda x: x>18,df['age'])) # filter adults

[20, 25, 30]

In [29]:
# give increment of 10 % 
df['income']=list(map(lambda x: int(x+x*0.1),df['income'])) 
df

   id     name  age  income
0   1    Shiva   20    4400
1   2     Hari   25    7700
2   3      Ram   15     220
3   4  Krishna   10       0
4   5   Madhav   30   11000

In [30]:
reduce(lambda a,b: a+b,df['income'])

23320

In [31]:
df['category']=df['age'].apply(lambda x: 'Adult' if x>=18 else 'Child')

In [32]:
df

   id     name  age  income category
0   1    Shiva   20    4400    Adult
1   2     Hari   25    7700    Adult
2   3      Ram   15     220    Child
3   4  Krishna   10       0    Child
4   5   Madhav   30   11000    Adult

In [71]:
# Class question on q1 and q3

In [70]:
L1 = [22, 29, 40, 30, 48, 24, 21, 19, 24, 22, 25, 52, 35, 40, 31, 37, 21, 23]

In [63]:

len(L1)

18

In [ ]:

# 9,10th term gives Median

In [61]:
L1.sort()

In [62]:
L1

[19, 21, 21, 22, 22, 23, 24, 24, 25, 29, 30, 31, 35, 37, 40, 40, 48, 52]

In [39]:
import numpy as np

In [68]:
np.quantile(L1,.25)

22.25

In [69]:
np.quantile(L1,.25,interpolation='midpoint')

22.5

In [66]:
#interpolation='linear' is default
np.quantile(LIST,.75)

36.5

In [67]:
np.quantile(LIST,.75,interpolation='midpoint')

36.0

In [72]:
# to be discussed

In [35]:
# import scipy.stats as stats
# import numpy as np
# import matplotlib.pyplot as plt
# %matplotlib inline

# n = 2000
# observation = np.random.binomial(n, 0.53, size = 1000)/n

# # standardize the observation
# z = (observation-np.mean(observation))/np.std(observation)

# stats.probplot(z, dist="norm", plot=plt)
# plt.title("Normal Q-Q plot")
# plt.show()